cases/hydrodynamic/risingBubble/2D/C2RESULTS_interFlow/160x320x001/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

application=$(getApplication)

restore0Dir

runApplication blockMesh
#runApplication setFields
runApplication setAlphaField

runApplication ${application}

# Post processing
grep -e '^Time =' -e '^bubble volume'   log.${application}                        | awk -F'=' '/Time =/ {t=$NF}  /bubble volume/   {print t" "$NF}' > bubble_volume.dat
grep -e '^Time =' -e '^bubble area'     log.${application}                        | awk -F'=' '/Time =/ {t=$NF}  /bubble area/     {print t" "$NF}' > bubble_area.dat
grep -e '^Time =' -e '^bubble diam.* A' log.${application}                        | awk -F'=' '/Time =/ {t=$NF}  /bubble diam.* A/ {print t" "$NF}' > bubble_diameterA.dat
grep -e '^Time =' -e '^bubble diam.* B' log.${application}                        | awk -F'=' '/Time =/ {t=$NF}  /bubble diam.* B/ {print t" "$NF}' > bubble_diameterB.dat
grep -e '^Time =' -e '^bubble centroid' log.${application} | sed -e 's/[\(\)]//g' | awk -F'=' '/Time =/ {t=$NF}  /bubble centroid/ {print t" "$NF}' > bubble_centroid.dat
grep -e '^Time =' -e '^bubble velocity' log.${application} | sed -e 's/[\(\)]//g' | awk -F'=' '/Time =/ {t=$NF}  /bubble velocity/ {print t" "$NF}' > bubble_velocity.dat
grep -e '^Time =' -e '^bubble circular' log.${application} | sed -e 's/[\(\)]//g' | awk -F'=' '/Time =/ {t=$NF}  /bubble circular/ {print t" "$NF}' > bubble_circularity.dat

# Control of CFL
grep '^Courant Number mean'           log.${application} | awk '{print $NF}' > maxCFL.dat
grep '^Interface Courant Number mean' log.${application} | awk '{print $NF}' > maxICFL.dat

#------------------------------------------------------------------------------
